print("введите два числа на РАЗНЫХ СТРОКАХ, где первое - номер столбца (1=А, ..., 8=Н), а второе - номер строки")
a = int(input())
b = int(input())
print("введите два числа на РАЗНЫХ СТРОКАХ, где первое - номер столбца (1=А, ..., 8=Н), а второе - номер строки")
c = int(input())
d = int(input())
if (a%2==0 and b%2==0 and c%2==0 and d%2==0) or (a%2==1 and b%2==1 and c%2==1 and d%2==1) or (a%2==1 and b%2==0 and c%2==1 and d%2==0) or (a%2==0 and b%2==1 and c%2==0 and d%2==1):
  print("одного цвета")
else:
  print("разного цвета")
